#include <iostream>
#include <iomanip>

int main() {
	char answer;
	do {
		setlocale(LC_ALL, "ru");
		system("color 0A");
		std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
		std::cout << "Задача 2.\n\nВариант 10.\n\nНайти минимальный среди элементов, лежащих ниже главной диагонали.\n\nВыполнил Шишов Егор.\n";
		std::cout << "------------------------------------------------------------------------------------------------------------------------\n";

		int min; bool first = true; //вторая задача
		int i, j;
		const int n = 6, m = 5;      //менять значения тут <-
		int a[n][m] = { {26,27,28,29,30},{-31,32,33,34,35},{12,12,13,14,15},{16,17,18,19,20},{21,0,23,24,25},{36,37,100,39,40} };
		std::cout << "n = " << n << "\n";
		std::cout << "m = " << m << "\n";

		//вывод массива
		for (i = 0; i < n; i++) {
			for (j = 0; j < m; j++) {
				std::cout << std::left << std::setw(3) << a[i][j] << " ";
			}
			std::cout << std::endl;
		}

		//обработка массива и поиск минимума
		for (i = 0; i < n; i++) {
			for (j = 0; j < m; j++) {
				if (j - i < 0) {
					if (first) {
						min = a[i][j];
						first = false;
					}
					else if (a[i][j] < min) {
						min = a[i][j];
					}
				}
			}
		}

		//какой-то важный код
		std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
		std::cout << "Минимальный элемент = " << min << "\n";
		std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
		std::cout << "Желаете продолжить?\n\nВведите с клавиатуры Y, если да, и N, если нет\n\n";
		std::cin >> answer;
		if (answer == 'Y') {
			system("cls");
			continue;
		}
		while (answer != 'Y') {
			rewind(stdin);
			if (answer == 'N') {
				return 0;
			}
			std::cout << "<Неправильный ввод(Y или N)>\n";
			std::cin >> answer;
			rewind(stdin);
		}
	} while (answer != 'N');
	return 0;
}