#include <iomanip>
#include <iostream>
#include <windows.h>

int main() { // задача 3
	setlocale(LC_ALL, "ru");
	/*system("mode con cols=150 lines=35");*/
	system("color 3F");
	std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
	std::cout << "Задача 3\n";
	std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
	std::cout << "Дана целочисленная матрица N.\nНайти сумму наименьших элементов ее нечетных строк и наибольших элементов ее четных столбцов\nВариант 10\nВыполнил Шишов Егор\n";
	std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
	std::cout << "Введите размер матрицы: ";
	int n;
	std::cin >> n;

	int** ppta = new int* [n];        //создание массива
	for (int i = 0; i < n; i++) {
		ppta[i] = new int[n];
	}

	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			ppta[i][j]=rand()%20+1;
		}
	}

	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			std::cout <<std::setw(3)<< ppta[i][j]<<" ";
		}
		std::cout << std::endl;
	}

	int sum1 = 0, sum2 = 0;  //обработка массива
	for (int i = 0; i < n; i+=2) {
		int min = ppta[i][0];
		for (int j = 1; j < n; j++) {
			if (ppta[i][j] < min) {
				min = ppta[i][j];
			}
		}
		sum1 += min;
	}

	for (int i = 1; i < n; i +=2) {
		int max = ppta[i][0];
		for (int j = 1; j < n; j++) {
			if (ppta[i][j] > max) {
				max = ppta[i][j];
			}
		}
		sum2 += max;
	}

	std::cout << "------------------------------------------------------------------------------------------------------------------------\n";
	std::cout << "min = " << sum1 << " max = " << sum2<<"\n";
	std::cout << "------------------------------------------------------------------------------------------------------------------------\n";

	for (int i = 0; i < n; i++) { //освобождение памяти
		delete[](ppta[i]);
	}
	delete[ ](ppta);
	char ans;
	std::cout << "Желаете продолжить? y/n (введите y - если желаете продолжить и n - если нет)\n";
	/*if ((ans = getchar()) == 'y') {
	}*/
	return 0;
}